[M_AssasinateTheAssassins:killOneywithsniper MissionObjectiveDefinition]
ProgressMessage="...with a sniper rifle"

[M_AssasinateTheAssassins:killwithmelee MissionObjectiveDefinition]
ProgressMessage="...with a melee attack"

[M_AssasinateTheAssassins:killwithshotgun MissionObjectiveDefinition]
ProgressMessage="...with a shotgun"

[M_AssasinateTheAssassins:killWotwithpistol MissionObjectiveDefinition]
ProgressMessage="...with a pistol"

